Revit 2027 API
ResolutionTarget Enumeration
 Indicates the resolution target(Screen or Printer) used for rendering settings.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum ResolutionTarget
Public Enumeration ResolutionTarget
public enum class ResolutionTarget
type ResolutionTarget
Members
Member name | Value | Description
Printer | 1 |  Uses printer resolution for rendering output settings.
Screen | 0 |  Uses screen resolution for rendering output settings.
See Also
Reference
Autodesk.Revit.DB Namespace